{
  "backend/main.mo": "Main Motoko actor for the backend that manages user profiles, global master templates, and document contents with access control and blob storage mixins. Exposes query and update functions for CRUD operations on templates, documents, and user profiles.",
  "feature_evidence.json": "Feature evidence report listing two implemented features: removing all QR code-related UI from the application, and adding a mobile-only 'Share PDF' button using the Web Share API with a download fallback.",
  "frontend-file-summaries.txt": "A JSON-formatted catalog of frontend source file summaries describing the purpose and key changes of each file, including QR removal, Share PDF addition, and type/import fixes across the codebase.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based design tokens for light and dark modes, covering background, foreground, card, border, chart, and sidebar color variables.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app titled 'Loan Document Generator', mounting the React app at the root div without any external script tags (QR code script removed).",
  "frontend/src/App.tsx": "Root React component that manages form state, PDF download logic, and the Advanced Template Designer dialog, wiring together FormSection, TemplateDesigner, and the useTemplates hook.",
  "frontend/src/components/FormSection.tsx": "Form component for entering borrower and loan details, managing custom fields, and triggering PDF downloads; includes mobile-only Share PDF buttons using the Web Share API with a download fallback via sharePdf utility.",
  "frontend/src/components/preview/TemplateOverlay.tsx": "Renders absolute-positioned overlay elements (background image, watermark text, seal, and signature) on top of a document preview using template configuration.",
  "frontend/src/components/PreviewDialog.tsx": "A modal dialog component that renders a document preview with a two-column header (business name/address and logo), watermark/background overlays, body content, and a signature/seal row.",
  "frontend/src/components/TemplateDesigner.tsx": "A multi-tab UI component for designing and managing both built-in and custom document templates, supporting logo/background uploads, template customization, saving, and deletion.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context and custom hook.",
  "frontend/src/hooks/useLocalStorageState.ts": "A generic React hook that synchronizes a state value with localStorage, initializing from stored data and persisting updates automatically.",
  "frontend/src/hooks/useQueries.ts": "A placeholder/stub file indicating all functionality is client-side only with no backend queries defined.",
  "frontend/src/hooks/useTemplates.ts": "A React hook that manages built-in and custom document templates, providing default templates for three loan document types and CRUD operations with localStorage persistence.",
  "frontend/src/index.css": "Global CSS file that configures Tailwind CSS and defines a warm orange/amber design token palette for both light and dark modes using CSS custom properties.",
  "frontend/src/lib/download.ts": "Provides a `downloadFile` utility that creates a temporary anchor element to trigger a browser file download, converting .pdf filenames to .png.",
  "frontend/src/lib/loan/calculateEmi.ts": "Exports `calculateEmi` to compute monthly EMI using the standard formula and `formatCurrency` to format numbers as Indian Rupees.",
  "frontend/src/lib/pdf/generatePdf.ts": "Orchestrates PDF generation by fetching the template, rendering it to a canvas, and returning the result as a PNG Blob.",
  "frontend/src/lib/pdf/layout.ts": "Defines A4 page dimension constants, margin sizes, and the content area rectangle used for canvas-based document rendering.",
  "frontend/src/lib/pdf/renderDocumentToCanvas.ts": "Renders a full document onto an HTML canvas including background image, watermark, two-column header, body content, signature/stamp row, footer, and generation date.",
  "frontend/src/lib/qr/qrPayload.ts": "Empty file with no current implementation.",
  "frontend/src/lib/qr/renderQr.ts": "Empty file with no current implementation.",
  "frontend/src/lib/shareUtils.ts": "Provides `sharePdf` which attempts to share a PDF Blob via the Web Share API, returning false if sharing is unsupported or fails.",
  "frontend/src/lib/templateAssets/fileToDataUrl.ts": "Converts an image File object to a base64 data URL using FileReader, rejecting non-image files.",
  "frontend/src/lib/templateAssets/positions.ts": "Maps `PositionPreset` values to CSS style objects (`getPositionStyle`) and to pixel coordinates on a canvas (`getCanvasPosition`).",
  "frontend/src/lib/templates/getTemplate.ts": "Returns a `Template` for a given document type by merging localStorage-stored custom templates with built-in defaults, normalizing missing fields.",
  "frontend/src/lib/templates/renderTemplate.ts": "Replaces mustache-style placeholders in a template's headline and body with values from `FormData`, including custom fields.",
  "frontend/src/lib/validation.ts": "Validates loan form data, returning an array of error messages for missing or incorrectly formatted fields including mobile and PAN number.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in `QueryClientProvider` and `InternetIdentityProvider`.",
  "frontend/src/types/form.ts": "Defines TypeScript interfaces for `FormData`, `CustomField`, and the `DocumentType` union used throughout the app.",
  "frontend/src/types/templates.ts": "Defines TypeScript interfaces for template-related types including `Template`, `CustomTemplate`, `WatermarkSettings`, `BackgroundSettings`, and `ImageElementSettings`.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL and hash query parameters, persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining dark mode, custom fonts (Inter, JetBrains Mono), oklch-based color tokens, border radius, accordion animations, and plugins (typography, container-queries, animate).",
  "project_state.json": "Project state metadata for the Loan Document Generator app, tracking schema version, existing features (QR code removal, mobile PDF sharing), pending action requests, and architectural notes."
}