{
  "backend/main.mo": "Main Motoko actor for the backend that manages global master templates, document contents, user profiles, and access control using authorization and blob-storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (Save button, Apply Header to All, and post-download Share flow) to their relevant source files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files describing the purpose and key details of each component, hook, utility, and configuration file.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "HTML entry point for the Vite/React app titled 'Loan Document Generator' that mounts the React root and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that manages form state, template designer dialog, PDF generation/download flow, and triggers the Web Share API via `sharePdf` after a successful download.",
  "frontend/src/components/FormSection.tsx": "Form component handling loan applicant fields, custom fields, EMI auto-calculation, and per-document-type Download and Share buttons that generate a PDF then invoke the Web Share API.",
  "frontend/src/components/preview/TemplateOverlay.tsx": "Renders absolute-positioned overlay elements (background image, watermark text, seal, and signature) on top of a document preview using template settings.",
  "frontend/src/components/PreviewDialog.tsx": "A modal dialog that renders a document preview using template data, displaying a two-column header (business name/address + logo), rendered body content, and optional signature/seal rows.",
  "frontend/src/components/TemplateDesigner.tsx": "A multi-tab UI component for designing and managing both built-in and custom document templates, supporting editing of header, watermark, background, signature, and seal settings with save/preview/delete actions.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flows, and identity persistence with status tracking.",
  "frontend/src/hooks/useLocalStorageState.ts": "A generic React hook that synchronizes a state value with localStorage, initializing from stored data and persisting updates automatically.",
  "frontend/src/hooks/useQueries.ts": "A placeholder/stub file indicating all functionality is client-side only with no backend queries defined.",
  "frontend/src/hooks/useTemplates.ts": "A hook managing state and persistence for built-in and custom document templates, providing CRUD operations and a bulk header-apply function backed by localStorage.",
  "frontend/src/index.css": "Global CSS file that configures Tailwind base/components/utilities and defines a warm orange/amber CSS custom property color palette for both light and dark modes.",
  "frontend/src/lib/download.ts": "A utility function that triggers a browser file download for a Blob, converting .pdf extensions to .png in the filename.",
  "frontend/src/lib/loan/calculateEmi.ts": "Exports a function to calculate monthly EMI using the standard formula and a currency formatter for Indian Rupees.",
  "frontend/src/lib/pdf/generatePdf.ts": "Generates a PNG blob from a document template and form data by rendering to a canvas element.",
  "frontend/src/lib/pdf/layout.ts": "Defines A4 page dimensions, margins, header/footer heights, and content area constants for PDF rendering at 96 DPI.",
  "frontend/src/lib/pdf/renderDocumentToCanvas.ts": "Renders a full document (background, watermark, header, body, signature/stamp, footer) onto an HTML canvas using template and form data.",
  "frontend/src/lib/qr/qrPayload.ts": "Empty file, likely a placeholder for QR code payload generation logic.",
  "frontend/src/lib/qr/renderQr.ts": "Empty file, likely a placeholder for QR code rendering logic.",
  "frontend/src/lib/shareUtils.ts": "Provides a utility to share a PDF blob via the Web Share API, returning false if sharing is unsupported or fails.",
  "frontend/src/lib/templateAssets/fileToDataUrl.ts": "Converts an image File object to a base64 data URL using FileReader.",
  "frontend/src/lib/templateAssets/positions.ts": "Maps position preset strings to CSS style objects and canvas pixel coordinates for placing elements like logos or stamps.",
  "frontend/src/lib/templates/getTemplate.ts": "Returns a normalized Template object for a given document type, checking localStorage for custom templates before falling back to built-in defaults.",
  "frontend/src/lib/templates/renderTemplate.ts": "Replaces mustache-style placeholders in a template's headline and body with values from form data, including custom fields.",
  "frontend/src/lib/validation.ts": "Validates loan form data fields (name, mobile, address, PAN, loan amount, interest rate, year) and returns an array of error messages.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/form.ts": "Defines TypeScript interfaces for FormData and CustomField, and the DocumentType union type for the three supported loan letter types.",
  "frontend/src/types/templates.ts": "Defines TypeScript interfaces for Template, CustomTemplate, and related settings types (background, watermark, image elements, position presets).",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read, store, retrieve, and clear URL parameters from query strings, hash-based routes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Inter, JetBrains Mono), OKLCH-based color tokens, border radius, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the current state of the Loan Document Generator project, including three existing features (Save button, Apply Header to All Templates, Share after download) and their corresponding pending action requests."
}