{
  "backend/main.mo": "Main Motoko actor implementing the loan document backend with user profile management, global/custom template CRUD, document storage, and loan processing record keeping, all gated by access control authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping two footer-related features (layout/styling fix and adding 4 partner images) to their affected files (PreviewDialog.tsx and renderDocumentToCanvas.ts) with associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "A JSON-formatted catalogue of short summaries for each frontend source file, describing the purpose and key characteristics of each component, hook, utility, and configuration file in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the full design token system (colors, radius, chart, sidebar) in both light and dark modes.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app titled 'Loan Document Generator' that mounts the React root and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React application component that wires together form state, template management hooks, PDF generation/download/share logic, and renders the page header, FormSection, and TemplateDesigner dialog inside a React Query provider.",
  "frontend/src/components/FormSection.tsx": "Loan application form component handling applicant details, loan parameters, bank account fields, custom fields, EMI auto-calculation, and document download/share actions for both built-in and custom document types.",
  "frontend/src/components/preview/TemplateOverlay.tsx": "Renders absolute-positioned overlay elements (background image, watermark, seal, signature) on top of a document preview based on the provided template configuration.",
  "frontend/src/components/PreviewDialog.tsx": "Renders a modal dialog showing a document preview with hardcoded Bajaj Finserv branding (logo, address, footer images) overlaid on a rendered template, including optional signature and seal rows.",
  "frontend/src/components/TemplateDesigner.tsx": "A UI component for designing and managing both built-in and custom document templates, supporting editing of template properties, previewing, saving to backend, and deleting custom templates.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, login status, and helper flags to consumers.",
  "frontend/src/hooks/useLocalStorageState.ts": "A generic React hook that synchronizes a state value with localStorage, initializing from stored data and persisting updates automatically.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating custom templates on the ICP backend, including getAllTemplates, getCustomTemplateById, addCustomTemplate, and updateCustomTemplate with error handling.",
  "frontend/src/hooks/useTemplates.ts": "React hook that manages both built-in and custom document templates, syncing local state with a backend via React Query and providing CRUD operations, serialization/deserialization helpers, and bulk header updates.",
  "frontend/src/index.css": "Global CSS entry point that sets up Tailwind directives and defines CSS custom properties for a warm orange/amber color palette in both light and dark modes.",
  "frontend/src/lib/download.ts": "Utility function that triggers a browser file download by creating a temporary object URL and anchor element, then cleaning up afterward.",
  "frontend/src/lib/loan/calculateEmi.ts": "Exports a function to calculate monthly EMI using the standard compound-interest formula and a helper to format numbers as Indian Rupee currency strings.",
  "frontend/src/lib/pdf/generatePdf.ts": "Generates a minimal valid PDF file from a rendered canvas by encoding the page as a JPEG and embedding it in a hand-built PDF byte stream without any external library.",
  "frontend/src/lib/pdf/layout.ts": "Defines A4 page dimension constants at 96 DPI, including margins, header/footer heights, and the usable content area rectangle.",
  "frontend/src/lib/pdf/renderDocumentToCanvas.ts": "Renders a loan document onto an HTML canvas with hardcoded Bajaj Finserv branding, drawing a two-column header with logo, template body content, signature/stamp row, and a footer with partner images.",
  "frontend/src/lib/qr/qrPayload.ts": "Empty file with no implemented content.",
  "frontend/src/lib/qr/renderQr.ts": "Empty file with no implemented content.",
  "frontend/src/lib/shareUtils.ts": "Utility that attempts to share a PDF blob via the Web Share API and returns a boolean indicating success, falling back gracefully when the API is unavailable.",
  "frontend/src/lib/templateAssets/fileToDataUrl.ts": "Converts an image File object to a base64 data URL using FileReader, rejecting non-image files.",
  "frontend/src/lib/templateAssets/positions.ts": "Provides helpers to convert a PositionPreset enum value into CSS position styles or pixel coordinates on a canvas, supporting five preset positions with a margin.",
  "frontend/src/lib/templates/getTemplate.ts": "Defines default built-in templates for three loan document types, and exports utilities to retrieve, normalize, and persist templates to localStorage, including custom template CRUD helpers.",
  "frontend/src/lib/templates/renderTemplate.ts": "Renders a document template by replacing placeholder tokens (e.g., {{name}}, {{loanAmount}}, custom fields) with actual form data values, returning the processed headline and body strings.",
  "frontend/src/lib/validation.ts": "Validates loan form data, returning an array of error messages for missing or invalid fields such as name, loan amount, interest rate, year, and processing charge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/form.ts": "Defines TypeScript interfaces and types for form data, including CustomField, LoanType, FormData, and DocumentType used throughout the loan document generator.",
  "frontend/src/types/templates.ts": "Defines TypeScript interfaces for document templates, including settings for background, watermark, logo, seal, signature, and both built-in and custom template structures.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme tokens (colors via OKLCH, fonts, border radius, shadows, animations) and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state for the Loan Document Generator, recording existing features, pending fix requests for footer layout/styling and adding 4 footer images, and image asset requirements."
}