{
  "kind": "build_request",
  "title": "Remove Loan GST and Add GST Watermark Image",
  "projectName": "Loan Document Generator",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the Loan GST document type from the application. This includes removing it from the DocumentType enum, the form's document type selector, any built-in template definitions for GST Letter in getTemplate.ts, and all related rendering/generation logic so it no longer appears as an option anywhere in the UI.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Remove loan gst"
        ]
      },
      "acceptanceCriteria": [
        "The GST Letter option no longer appears in the document type dropdown or selector in the form UI",
        "The DocumentType enum no longer includes a GST Letter entry",
        "No GST Letter template body or default Template config remains in getTemplate.ts",
        "Generating or downloading a GST Letter document is no longer possible"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add the uploaded GST watermark image (Goods and Services Tax / Ashoka Pillar emblem) as a static asset at frontend/public/assets/generated/gst-watermark.png and use it as the default watermark image on the GST Letter document template. The watermark should be rendered centered on the document with reduced opacity so it does not obscure the text content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add watermark image on gst letter use attached image"
        ]
      },
      "acceptanceCriteria": [
        "The GST emblem image is saved as a static asset at frontend/public/assets/generated/gst-watermark.png",
        "The watermark is rendered centered on the GST Letter document canvas with reduced opacity (e.g., 0.15–0.25)",
        "The watermark does not obscure the body text of the GST Letter",
        "The watermark is visible in both the preview dialog and the generated/downloaded PDF"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed under frontend.immutablePaths",
    "Use the exact uploaded image (Goods and Services Tax / Ashoka Pillar emblem) as the watermark — do not substitute a different image"
  ],
  "nonGoals": [
    "Adding new document types beyond what already exists",
    "Redesigning the overall UI layout or color theme",
    "Modifying watermark behavior for non-GST document types"
  ],
  "imageRequirements": {
    "required": [
      "Goods and Services Tax Ashoka Pillar emblem logo with tricolor (saffron, white, green) decorative wings and 'Goods and Services Tax' text label, square format (gst-watermark.dim_400x400.png)"
    ],
    "edits": []
  }
}