{
  "kind": "build_request",
  "title": "Add Save Button to Template Editor, Apply Header to All Templates, and Share After Download",
  "projectName": "Loan Document Generator",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a visible 'Save' button inside the template editor (TemplateDesigner component) that explicitly saves the current template configuration to localStorage. The button should provide visual feedback (e.g., a brief 'Saved!' confirmation state) after successfully saving.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "want save button in in teplete editor"
        ]
      },
      "acceptanceCriteria": [
        "A 'Save' button is visibly present within the template editor UI.",
        "Clicking the Save button persists the current template settings to localStorage.",
        "The button shows a brief confirmation state (e.g., label changes to 'Saved!') after saving, then reverts to 'Save'.",
        "The Save button is accessible across all template tabs in the editor."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add an 'Apply Header to All Templates' action in the template editor that copies the current template's header settings (business name, address, logo) to all other templates stored in localStorage. Display a confirmation prompt before applying to prevent accidental overwrites.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "aply header to all templete"
        ]
      },
      "acceptanceCriteria": [
        "An 'Apply Header to All Templates' button or action is present in the template editor.",
        "Clicking the action shows a confirmation dialog warning the user that it will overwrite header settings in all templates.",
        "Upon confirmation, the header settings (business name, address, logo image) from the currently active template are copied to all other templates in localStorage.",
        "A success message is shown after the operation completes.",
        "All templates reflect the updated header settings immediately without requiring a page reload."
      ]
    },
    {
      "id": "REQ-3",
      "text": "After a document is successfully downloaded (PNG/PDF), automatically trigger the share flow using the Web Share API (falling back to a direct download prompt if unsupported). The Share button should be surfaced in the download confirmation UI or as a follow-up action after download completes in FormSection.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "share file after download01"
        ]
      },
      "acceptanceCriteria": [
        "After a document download completes, a 'Share' option is presented to the user.",
        "The share action uses the Web Share API (`navigator.share`) with the downloaded file as the shared content.",
        "If the Web Share API is unavailable, the share button is either hidden or falls back to re-triggering the file download.",
        "The share flow works consistently with the existing `sharePdf` utility in `frontend/src/lib/shareUtils.ts`.",
        "The share action is accessible on both mobile and desktop where supported."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "All template persistence must continue to use localStorage via the existing useTemplates hook pattern.",
    "The existing sharePdf utility in frontend/src/lib/shareUtils.ts must be reused, not replaced."
  ],
  "nonGoals": [
    "Backend persistence of template data — all template storage remains client-side in localStorage.",
    "Redesigning or restructuring the existing template editor tabs or layout beyond adding the requested buttons.",
    "Adding new document types or form fields.",
    "Real-time collaboration or multi-user template sharing."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}