{
  "kind": "build_request",
  "title": "Add TDS Deduction Intimation Letter Template",
  "projectName": "Loan Document Generator",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new built-in document template named 'TDS Deduction Intimation' to the template library in `frontend/src/lib/templates/getTemplate.ts`. The template body must contain the following exact text with dynamic placeholders preserved:\n\n---\nApplication Number: APLOAN74962926\nLoan Number: PLOAN6926946926\nSubject: TDS Deduction Intimation\n\nDear {{name}},\n\nGreetings from the Loan Department. This is to formally inform you that, in accordance with applicable taxation guidelines, TDS-related formalities have been initiated in connection with your {{loanType}} loan under Application Number APLOAN74962926 and Loan Number PLOAN6926946926.\n\nAs per our records, the sanctioned loan amount for your application is ₹{{loanAmount}}. All statutory deductions and reporting requirements are being processed in line with prevailing financial and tax regulations. You are advised to retain this letter for your records and future reference.\n\nPlease note that any processing charge of ₹{{processingCharge}} paid towards documentation, verification, or file handling will be accounted for as per the company's financial policies and applicable tax provisions. Where eligible, the same will be adjusted or refunded in accordance with the approved terms and compliance requirements.\n\nOur team is committed to maintaining full transparency throughout the loan lifecycle. Should you require any clarification regarding TDS treatment or related documentation, please feel free to contact our support team.\n\nWarm regards,\nLoan Department\n---\n\nThe placeholders {{name}}, {{loanType}}, {{loanAmount}}, and {{processingCharge}} must be substituted by the `renderTemplate` utility at render time. The fixed strings APLOAN74962926 and PLOAN6926946926 remain as literal text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Create new templete with text contain",
          "Application Number: APLOAN74962926",
          "Loan Number: PLOAN6926946926",
          "Subject: TDS Deduction Intimation"
        ]
      },
      "acceptanceCriteria": [
        "A template with the name 'TDS Deduction Intimation' appears in the template selector dropdown alongside existing templates.",
        "Selecting the template populates the preview/form with the full letter body as specified.",
        "The placeholders {{name}}, {{loanType}}, {{loanAmount}}, and {{processingCharge}} are replaced with actual form values when the document is rendered or previewed.",
        "The fixed values APLOAN74962926 and PLOAN6926946926 appear verbatim in both the Application Number and Loan Number lines.",
        "The template is available for PDF generation and download via the existing document generation flow."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the new 'TDS Deduction Intimation' template is included in the `getTemplate` / template normalization functions and is returned alongside existing built-in templates when templates are fetched or listed. The template's `DocumentType` (or equivalent identifier) must be consistent with the naming conventions used by other built-in templates in the codebase.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ]
      },
      "acceptanceCriteria": [
        "The new template appears in all places where built-in templates are listed (e.g., template selector, TemplateDesigner).",
        "No TypeScript type errors are introduced by adding the new template identifier.",
        "The template can be selected, previewed, and used to generate a PDF without errors."
      ]
    }
  ],
  "constraints": [
    "The fixed Application Number (APLOAN74962926) and Loan Number (PLOAN6926946926) must remain as literal text in the template body — they are not placeholders.",
    "Do not modify any files listed under frontend.immutablePaths.",
    "Do not alter existing templates or their content."
  ],
  "nonGoals": [
    "Adding a new backend data model or persisting the template in the Motoko actor (built-in templates are frontend-only).",
    "Modifying the renderTemplate utility logic.",
    "Changing the PDF rendering or canvas layout."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}