{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix footer layout and add 4 images to footer",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the footer layout and styling in the rendered document to ensure proper alignment, consistent padding/margins, and visual coherence with the overall document design",
      "acceptanceCriteria": [
        "Footer is correctly positioned at the bottom of the document preview",
        "Footer has consistent spacing and alignment",
        "Footer styling is visually coherent with the rest of the document"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PreviewDialog.tsx",
          "operation": "modify",
          "description": "Fix footer layout in the document preview by adjusting the footer container styling for proper alignment, consistent padding/margins, and visual consistency. Ensure the footer flexbox layout properly spaces content and matches the document's overall design theme."
        },
        {
          "path": "frontend/src/lib/pdf/renderDocumentToCanvas.ts",
          "operation": "modify",
          "description": "Fix footer rendering in the canvas-based PDF output by adjusting footer positioning calculations, text alignment, padding values, and spacing to match the corrected PreviewDialog footer layout. Ensure the footer appears at the correct Y position with consistent margins."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add 4 user-provided images to the footer area in the rendered document, displaying them horizontally as static assets from frontend/public/assets/generated/",
      "acceptanceCriteria": [
        "4 images are displayed in the footer of the document preview",
        "Images are laid out horizontally and evenly spaced within the footer",
        "Images are rendered correctly in both the preview dialog and the PDF canvas output",
        "Images are served from frontend/public/assets/generated/"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PreviewDialog.tsx",
          "operation": "modify",
          "description": "Add 4 footer images to the document preview by creating a horizontal image row container in the footer section. Reference the generated images using their exact workspace paths: frontend/public/assets/generated/footer-img-1.dim_200x80.png, frontend/public/assets/generated/footer-img-2.dim_200x80.png, frontend/public/assets/generated/footer-img-3.dim_200x80.png, and frontend/public/assets/generated/footer-img-4.dim_200x80.png. Use img elements with src='/assets/generated/footer-img-N.dim_200x80.png' and apply flexbox or grid layout to evenly space them horizontally within the footer."
        },
        {
          "path": "frontend/src/lib/pdf/renderDocumentToCanvas.ts",
          "operation": "modify",
          "description": "Add 4 footer images to the canvas PDF rendering by loading the generated images from their workspace paths (frontend/public/assets/generated/footer-img-1.dim_200x80.png through footer-img-4.dim_200x80.png) and drawing them horizontally in the footer area using canvas drawImage(). Calculate X positions to evenly distribute the 4 images (200x80 each) across the footer width, maintaining consistent spacing. Ensure images are loaded before rendering and handle any loading errors gracefully."
        }
      ]
    }
  ]
}