{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace first footer image with uploaded signature/branding image",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the first of the 4 footer images with the uploaded Dhani Finance LTD. signature block image in both preview and PDF rendering",
      "acceptanceCriteria": [
        "The uploaded image (Dhani Finance LTD. signature block) is saved as frontend/public/assets/generated/footer-image-1.png",
        "PreviewDialog.tsx renders the new image as the first footer image",
        "renderDocumentToCanvas.ts draws the new image as the first footer image in generated PDFs",
        "The other 3 footer images remain unchanged",
        "The first footer image visually displays the 'Yours faithfully, Dhani Finance LTD.' signature block with P Harish Reddy CEO details"
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/footer-image-1.png",
          "operation": "create",
          "description": "Save the uploaded image file '20260228_092922_0002.png' (showing 'Yours faithfully, Dhani Finance LTD.' with signature and 'P Harish Reddy, Chief Executive Officer') as the first footer image asset. This image will replace the existing first footer image in both the preview dialog and PDF rendering."
        },
        {
          "path": "frontend/src/components/PreviewDialog.tsx",
          "operation": "modify",
          "description": "Update the first footer image reference from its current path to '/assets/generated/footer-image-1.png'. Ensure the other three footer images remain unchanged. The component currently renders four hardcoded footer images; modify only the first one to use the new Dhani Finance LTD. signature block image."
        },
        {
          "path": "frontend/src/lib/pdf/renderDocumentToCanvas.ts",
          "operation": "modify",
          "description": "Update the first footer image path in the canvas rendering logic from its current location to '/assets/generated/footer-image-1.png'. The function currently draws four footer images onto the canvas; modify only the first image loading/drawing logic to use the new Dhani Finance LTD. signature block. Preserve the rendering of the remaining three footer images exactly as they are."
        }
      ]
    }
  ]
}