{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Save Button to Template Editor, Apply Header to All Templates, and Share After Download",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a visible 'Save' button inside the template editor that saves the current template to localStorage with visual confirmation feedback",
      "acceptanceCriteria": [
        "A 'Save' button is visibly present within the template editor UI.",
        "Clicking the Save button persists the current template settings to localStorage.",
        "The button shows a brief confirmation state (e.g., label changes to 'Saved!') after saving, then reverts to 'Save'.",
        "The Save button is accessible across all template tabs in the editor."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TemplateDesigner.tsx",
          "operation": "modify",
          "description": "Add a 'Save' button to the template editor UI that explicitly calls the saveTemplate function from useTemplates hook. Implement a temporary 'Saved!' confirmation state that displays for 2 seconds after saving, then reverts to 'Save'. Position the button prominently in the template editor header or action bar, accessible across all template tabs (built-in and custom). Use existing UI components from components/ui for consistent styling."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add an 'Apply Header to All Templates' action that copies the current template's header settings to all other templates with confirmation prompt",
      "acceptanceCriteria": [
        "An 'Apply Header to All Templates' button or action is present in the template editor.",
        "Clicking the action shows a confirmation dialog warning the user that it will overwrite header settings in all templates.",
        "Upon confirmation, the header settings (business name, address, logo image) from the currently active template are copied to all other templates in localStorage.",
        "A success message is shown after the operation completes.",
        "All templates reflect the updated header settings immediately without requiring a page reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useTemplates.ts",
          "operation": "modify",
          "description": "Add an 'applyHeaderToAllTemplates' function that accepts businessName, businessAddress, and logoUrl as parameters. This function should iterate through all built-in document types (agreement, sanction, noc) and all custom templates, updating their headerBusinessName, headerBusinessAddress, and logo fields in localStorage. Return success/failure status to allow the UI to show appropriate feedback."
        },
        {
          "path": "frontend/src/components/TemplateDesigner.tsx",
          "operation": "modify",
          "description": "Add an 'Apply Header to All Templates' button in the template editor header or action bar. When clicked, display a confirmation dialog (using existing UI components from components/ui) warning the user that this action will overwrite header settings in all templates. On confirmation, call the applyHeaderToAllTemplates function from useTemplates hook with the current template's businessName, businessAddress, and logo. Show a success toast or message after completion. Ensure the UI reflects the updated templates immediately by refreshing the template state."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "After a document is successfully downloaded, automatically trigger the share flow using the Web Share API with fallback to download prompt",
      "acceptanceCriteria": [
        "After a document download completes, a 'Share' option is presented to the user.",
        "The share action uses the Web Share API (`navigator.share`) with the downloaded file as the shared content.",
        "If the Web Share API is unavailable, the share button is either hidden or falls back to re-triggering the file download.",
        "The share flow works consistently with the existing `sharePdf` utility in `frontend/src/lib/shareUtils.ts`.",
        "The share action is accessible on both mobile and desktop where supported."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "After a successful PDF download in the handleDownload function, automatically call the sharePdf utility from frontend/src/lib/shareUtils.ts with the generated PDF blob and filename. If sharePdf returns true (share successful), optionally display a brief confirmation. If it returns false (share unsupported or failed), the user already has the downloaded file. Ensure the share action happens after the download completes successfully."
        },
        {
          "path": "frontend/src/components/FormSection.tsx",
          "operation": "modify",
          "description": "After the existing mobile-only Share PDF buttons trigger a download, automatically call the sharePdf utility from frontend/src/lib/shareUtils.ts with the generated PDF blob and filename. This ensures the share flow happens immediately after download on mobile devices. Keep the existing Web Share API detection and fallback logic consistent with the sharePdf utility."
        }
      ]
    }
  ]
}